BAS BMEKZU Project/src/ChartsOfCalculationTypes/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>Удержания</name>
  <comment>(Регл)</comment>
  <baseCalculationTypes>ChartOfCalculationTypes.Начисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.Удержания</baseCalculationTypes>
  <attributes>
    <name>КатегорияУдержания</name>
    <type>
      <types>EnumRef.КатегорииУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередностьРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУдержанияДляТиповыхОтчетов</name>
    <type>
      <types>EnumRef.ВидыУдержанийДляТиповыхОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВзаиморасчетов</name>
    <type>
      <types>EnumRef.УдалитьВидыВзаиморасчетовСРаботниками</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬСпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬЭтоАлименты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬКатегорияРасчета</name>
    <type>
      <types>EnumRef.КатегорииРасчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УДАЛИТЬБазовыеВидыРасч</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCalculationTypes>

BAS BMEKZU Project/src/ChartsOfCalculationTypes/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>Начисления</name>
  <comment>(Регл)</comment>
  <baseCalculationTypes>ChartOfCalculationTypes.Начисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>ДоплатаДоМЗП</name>
      <description>Доплата до МЗП</description>
    </items>
    <items>
      <name>ИндексацияЗарплаты</name>
      <description>Индексация зарплаты</description>
    </items>
    <items>
      <name>ОкладПоДням</name>
      <description>Оклад по дням</description>
    </items>
    <items>
      <name>ОкладПоЧасам</name>
      <description>Оклад по часам</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуБЛОрганизации</name>
      <description>Оплата больничных (за сч. предпр.)</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуБЛ</name>
      <description>Оплата больничных (за сч. ФСС)</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуОтп</name>
      <description>Оплата отпуска</description>
    </items>
    <items>
      <name>ТарифДневной</name>
      <description>Оплата по дневному тарифу</description>
    </items>
    <items>
      <name>ТарифЧасовой</name>
      <description>Оплата по часовому тарифу</description>
    </items>
  </predefined>
  <attributes>
    <name>КатегорияНачисленияИлиНеоплаченногоВремени</name>
    <type>
      <types>EnumRef.КатегорииНачисленийИНеоплаченногоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередностьРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетОтработанногоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетНормыВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаБазовыхНачислений</name>
    <type>
      <types>EnumRef.ПериодыРасчетаБазовыхНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМесяцевБазовогоПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоходНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЕСВ</name>
    <type>
      <types>EnumRef.ВидыЕСВ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияОтраженияВУчете</name>
    <type>
      <types>EnumRef.СтратегииОтраженияВУчетеНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчет1ПВПоказателиВидовОплатыТруда</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчет3ПВВидИспользованияРабочегоВремени</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияДляТиповыхОтчетов</name>
    <type>
      <types>EnumRef.ВидыНачисленийДляТиповыхОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВзаиморасчетов</name>
    <type>
      <types>EnumRef.УдалитьВидыВзаиморасчетовСРаботниками</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬКатегорияРасчета</name>
    <type>
      <types>EnumRef.КатегорииРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬЭтоОклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬЭтоОтпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬЭтоБольничные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬЭтоЗарплатаМобилизованным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬСоциальнаяГруппа</name>
    <comment>Используется для расчета индексации</comment>
    <type>
      <types>EnumRef.СоциальныеГруппыНаселения</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬИндексируетсяРасчетом</name>
    <type>
      <types>ChartOfCalculationTypesRef.Начисления</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬБазаПоНазначению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬПропорцияВремениПоЧасам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПропорцииВремени</name>
    <type>
      <types>EnumRef.ВидыПропорцииВремени</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

BAS BMEKZU Project/src/CommonForms/ПодборВидовРасчета/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ПодборУдержаний = Ложь;
	Если Параметры.Свойство("ПодборУдержаний") Тогда 
		ПодборУдержаний = Истина;
	КонецЕсли;	
	
	Отбор = Неопределено;
	Если Не Параметры.Свойство("УсловияОтбора", Отбор) Тогда 
		Отбор = Новый Структура;
	КонецЕсли;	
	
	ЗаполнитьВидыРасчета(Параметры.МассивВидовРасчета, ПодборУдержаний, Отбор);
	
	Заголовок = ?(ПодборУдержаний, НСтр("ru='Подбор удержаний';uk='Підбір утримань'"), НСтр("ru='Подбор начислений';uk='Підбір нарахувань'"));
	
	Если ПодборУдержаний Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидыРасчетаКодДоходаНДФЛ", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидыРасчетаКодДоходаСтраховыеВзносы", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВыбранныеВидыРасчета", "Заголовок", НСтр("ru='Выбранные удержания';uk='Вибрані утримання'"));
	КонецЕсли;	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	ОповеститьОВыборе(ИзмененныеВидыРасчетаСтруктура());
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьВидыРасчета(МассивВидовРасчета, ПодборУдержаний, Отбор)
	
	ИсходныеВидыРасчета.ЗагрузитьЗначения(МассивВидовРасчета);
	ВыбранныеВидыРасчета.ЗагрузитьЗначения(МассивВидовРасчета);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ИсходныеВидыРасчета", ИсходныеВидыРасчета);
	
	Если ПодборУдержаний Тогда 
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВидыРасчета.Ссылка КАК ВидРасчета,
		               |	ВидыРасчета.Код КАК Код,
		               |	ВЫБОР
		               |		КОГДА ВидыРасчета.Ссылка В (&ИсходныеВидыРасчета)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК Выбран,
		               |	ВидыРасчета.КатегорияУдержания КАК Категория
		               |ИЗ
		               |	ПланВидовРасчета.Удержания КАК ВидыРасчета
		               |ГДЕ
		               |	&УсловиеОтбора
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ВидыРасчета.РеквизитДопУпорядочивания";
					   
	Иначе 				   
	
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВидыРасчета.Ссылка КАК ВидРасчета,
		               |	ВидыРасчета.Код КАК Код,
		               |	ВидыРасчета.ДоходНДФЛ КАК КодДоходаНДФЛ,
		               |	ВидыРасчета.ВидЕСВ КАК ВидЕСВ,
		               |	ВЫБОР
		               |		КОГДА ВидыРасчета.Ссылка В (&ИсходныеВидыРасчета)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК Выбран,
		               |	ВидыРасчета.КатегорияНачисленияИлиНеоплаченногоВремени  КАК Категория
		               |ИЗ
		               |	ПланВидовРасчета.Начисления КАК ВидыРасчета
		               |ГДЕ
		               |	&УсловиеОтбора
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ВидыРасчета.РеквизитДопУпорядочивания";
					   
	КонецЕсли;
	
	Условие = "";
	Для каждого ЭлементОтбора Из Отбор Цикл
		Если НЕ ПустаяСтрока(Условие) Тогда
			Условие = Условие + Символы.ПС + "И ";
		КонецЕсли;
		Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
		Условие = Условие  + "ВидыРасчета." + ЭлементОтбора.Ключ + " = &" + ЭлементОтбора.Ключ;
	КонецЦикла;
	Условие = ?(ЗначениеЗаполнено(Условие), Условие, "Истина");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", Условие);
	
	ВидыРасчета.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция ИзмененныеВидыРасчетаСтруктура()
	
	ВыбранныеСтроки = ВидыРасчета.НайтиСтроки(Новый Структура("Выбран", Истина));
	
	ТекущиеВидыРасчета = ОбщегоНазначения.ВыгрузитьКолонку(ВыбранныеСтроки, "ВидРасчета", Истина);
	МассивИсходныхВидовРасчета = ИсходныеВидыРасчета.ВыгрузитьЗначения();
	
	УдаленныеВидыРасчета = ОбщегоНазначенияКлиентСервер.СократитьМассив(МассивИсходныхВидовРасчета, ТекущиеВидыРасчета);
	ДобавленныеВидыРасчета = ОбщегоНазначенияКлиентСервер.СократитьМассив(ТекущиеВидыРасчета, МассивИсходныхВидовРасчета);
	
	ИзмененныеВидыРасчета = Новый Структура;
	ИзмененныеВидыРасчета.Вставить("УдаленныеВидыРасчета", УдаленныеВидыРасчета);
	ИзмененныеВидыРасчета.Вставить("ДобавленныеВидыРасчета", ДобавленныеВидыРасчета);
	
	Возврат ИзмененныеВидыРасчета;
	
КонецФункции	

&НаКлиенте
Процедура ВидыРасчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда 
		
		Элемент.ТекущиеДанные.Выбран = Не Элемент.ТекущиеДанные.Выбран;
		
		ЭлементСписка = ВыбранныеВидыРасчета.НайтиПоЗначению(Элемент.ТекущиеДанные.ВидРасчета);
		Если ЭлементСписка <> Неопределено Тогда
			ВыбранныеВидыРасчета.Удалить(ЭлементСписка);
		Иначе 
			ВыбранныеВидыРасчета.Добавить(Элемент.ТекущиеДанные.ВидРасчета);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры
